# Задание: Дан файл numbers.txt, в котором записаны целые числа, каждое с новой строки.
# Напишите программу, которая считывает эти числа, находит их сумму и записывает результат в файл sum.txt.

# Задание: Создайте класс Student с атрибутами name (строка), age (целое число),
# grades (список целых чисел). Создайте экземпляр этого класса с произвольными данными.
# Сохраните состояние объекта в файл student.pkl с помощью модуля pickle.
# Затем загрузите объект из файла и выведите все его атрибуты на экран.